package ExceptionHomeWork;

/*
Написать калькулятор.
Калькулятор считывает с консоли одно из выражений (n+m / n-m / nХm / n/m, где n и m - целые числа)
или exit для завершения работы. Калькулятор выводит результат вычисления в консоль, после чего ожидает ввода
нового выражения или exit для завершения работы.

В случае если введенное выражение не совпадает с заданным шабломом, выбрасывает исключения: отсутствуют n или m -
выбрасывать один тип исключения, указан не тот оператор - выбрасывать другое исключение, в качестве оператора указан /,
а второй операнд 0, либо n или m не целые числа - выбрасывать третий тип исключения.

Необходимо написать свои классы исключений. Исключения должны быть проверяемыми (checked).
Метод исключений getMessage() необходимо переопределить (реализация на Ваше усмотрение).
*/

public class Calculator {
}
